/*
 *   여러줄 주석
 *   1. 자바 실행 과정 
 *      .java =========> class명과 동일  
 *      ------------------ 원시소스 (프로그래머만 아는 언어) : 컴퓨터는 알 수 없는 소스 
 *        |
 *        |  컴퓨터가 인식하는 언어로 변경 (컴파일)  ==> javac
 *      .class =======> 바이트 코드 (기계어)
 *        |
 *        |  한줄씩 번역 (인터프리터) ==> java
 *      번역된 내용을 화면에 출력 
 *      ----------------------------------------- javac + java => Ctrl+F11
 *   2. 자바 사용 
 *      ------- 1) 호환성 (운영체제에 상관없이 작동) => 운영체제의 독립적이다 
 *      ------- 2) 무료 (jdk 1.8) => jdk 1.9 (오라클에서 제작) => 라이센스
 *      ------- 3) 버전호환 
 *   3. 자바의 발전 과정 (백서) ==> 1995/5/23 => 1996 (JavaApplet) => 동적 웹
 *      ====> 분당/판교 , 강남 , 상암 , 구디/가디 (SI/SM)
 *            ------- 솔루션 
 *      자바 
 *      오라클  
 *      HTML/CSS/JS
 *      Ajax / Jquery
 *      JSP
 *      MVC 
 *      -------------------------- 1
 *      Spring 
 *      VueJS
 *      -------------------------- 2
 *      Spring-Boot
 *      React
 *      -------------------------- 3
 *      
 *      자바 : 가전 제품 (게임기 : 세븐 스타) ====> 임베디드 (모바일)
 *            => 그린 프로젝트 (통합 리모콘) ==> 후원자 (X) 
 *            => 네스케이프 (브라우저) ======> 웹 프로그램 (자바스크립트)
 *            => 독립 (자바) <====> MS
 *               ----------
 *               운영체제 (솔라리스,언어) ===> 데이터베이스 (MySQL) ==> 부도 ==> 오라클 인수 (유료화)
 *                  openjdk / jdk 
 *                  -------
 *            => 제임스 고슬링 / 아서벤 
 *               --              --
 *               JA              VA    ===> Java 
 *               => C++ / Java 객체 지향 (사람중심) ==> C++ (C문법) => javah
 *                  ----
 *                  C With Class  => 객체 지향 (기계)
 *      ==== 특징 (면접) ==> 3
 */
// 한줄 주석 
public class MainClass_1 {

	public static void main(String[] args) {
		// TODO Auto-generated method stub
		System.out.println("Hello Java!!");
	}

}
